# AWS Glue Studio Notebook
##### You are now running a AWS Glue Studio notebook; To start using your notebook you need to start an AWS Glue Interactive Session.

#### Optional: Run this cell to see available notebook commands ("magics").

In [ ]:
%help

####  Run this cell to set up and start your interactive session.

In [1]:
%idle_timeout 2880
%glue_version 3.0
%worker_type G.1X
%number_of_workers 5

import sys
from awsglue.transforms import *
from awsglue.utils import getResolvedOptions
from pyspark.context import SparkContext
from awsglue.context import GlueContext
from awsglue.job import Job
  
sc = SparkContext.getOrCreate()
glueContext = GlueContext(sc)
spark = glueContext.spark_session
job = Job(glueContext)

Welcome to the Glue Interactive Sessions Kernel
For more information on available magic commands, please type %help in any new cell.

Please view our Getting Started page to access the most up-to-date information on the Interactive Sessions kernel: https://docs.aws.amazon.com/glue/latest/dg/interactive-sessions.html
Installed kernel version: 0.37.0
Current idle_timeout is 2800 minutes.
idle_timeout has been set to 2880 minutes.
Setting Glue version to: 3.0
Previous worker type: G.1X
Setting new worker type to: G.1X
Previous number of workers: 5
Setting new number of workers to: 5
Authenticating with environment variables and user-defined glue_role_arn: arn:aws:iam::835769464848:role/IAM-Role-etl-project
Trying to create a Glue session for the kernel.
Worker Type: G.1X
Number of Workers: 5
Session ID: cb879fe5-556a-47cc-907a-49f544026ee1
Job Type: glueetl
Applying the following default arguments:
--glue_kernel_version 0.37.0
--enable-glue-datacatalog true
Waiting for session cb879fe5-556a-47cc-907a-49f544026ee1 to get into ready status...
Session cb879fe5-556a-47cc-907a-49f544026ee1 has been created.

#### Example: Create a DynamicFrame from a table in the AWS Glue Data Catalog and display its schema

In [2]:
dyf = glueContext.create_dynamic_frame.from_catalog(database='etl-project-for-medium-database', table_name='raw_data')
dyf.printSchema()

root
|-- id: long
|-- year_birth: long
|-- education: string
|-- marital_status: string
|-- income: long
|-- kidhome: long
|-- teenhome: long
|-- dt_customer: string
|-- recency: long
|-- mntwines: long
|-- mntfruits: long
|-- mntmeatproducts: long
|-- mntfishproducts: long
|-- mntsweetproducts: long
|-- mntgoldprods: long
|-- numdealspurchases: long
|-- numwebpurchases: long
|-- numcatalogpurchases: long
|-- numstorepurchases: long
|-- numwebvisitsmonth: long
|-- acceptedcmp3: long
|-- acceptedcmp4: long
|-- acceptedcmp5: long
|-- acceptedcmp1: long
|-- acceptedcmp2: long
|-- complain: long
|-- z_costcontact: long
|-- z_revenue: long
|-- response: long

#### Convert the DynamicFrame to a Spark DataFrame and display a sample of the data

In [3]:
df = dyf.toDF()
df.show()

+----+----------+----------+--------------+------+-------+--------+-----------+-------+--------+---------+---------------+---------------+----------------+------------+-----------------+---------------+-------------------+-----------------+-----------------+------------+------------+------------+------------+------------+--------+-------------+---------+--------+
|  id|year_birth| education|marital_status|income|kidhome|teenhome|dt_customer|recency|mntwines|mntfruits|mntmeatproducts|mntfishproducts|mntsweetproducts|mntgoldprods|numdealspurchases|numwebpurchases|numcatalogpurchases|numstorepurchases|numwebvisitsmonth|acceptedcmp3|acceptedcmp4|acceptedcmp5|acceptedcmp1|acceptedcmp2|complain|z_costcontact|z_revenue|response|
+----+----------+----------+--------------+------+-------+--------+-----------+-------+--------+---------+---------------+---------------+----------------+------------+-----------------+---------------+-------------------+-----------------+-----------------+------------+------------+------------+------------+------------+--------+-------------+---------+--------+
|5524|      1957|Graduation|        Single| 58138|      0|       0| 2012-09-04|     58|     635|       88|            546|            172|              88|          88|                3|              8|                 10|                4|                7|           0|           0|           0|           0|           0|       0|            3|       11|       1|
|2174|      1954|Graduation|        Single| 46344|      1|       1| 2014-03-08|     38|      11|        1|              6|              2|               1|           6|                2|              1|                  1|                2|                5|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|4141|      1965|Graduation|      Together| 71613|      0|       0| 2013-08-21|     26|     426|       49|            127|            111|              21|          42|                1|              8|                  2|               10|                4|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|6182|      1984|Graduation|      Together| 26646|      1|       0| 2014-02-10|     26|      11|        4|             20|             10|               3|           5|                2|              2|                  0|                4|                6|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|5324|      1981|       PhD|       Married| 58293|      1|       0| 2014-01-19|     94|     173|       43|            118|             46|              27|          15|                5|              5|                  3|                6|                5|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|7446|      1967|    Master|      Together| 62513|      0|       1| 2013-09-09|     16|     520|       42|             98|              0|              42|          14|                2|              6|                  4|               10|                6|           0|           0|           0|           0|           0|       0|            3|       11|       0|
| 965|      1971|Graduation|      Divorced| 55635|      0|       1| 2012-11-13|     34|     235|       65|            164|             50|              49|          27|                4|              7|                  3|                7|                6|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|6177|      1985|       PhD|       Married| 33454|      1|       0| 2013-05-08|     32|      76|       10|             56|              3|               1|          23|                2|              4|                  0|                4|                8|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|4855|      1974|       PhD|      Together| 30351|      1|       0| 2013-06-06|     19|      14|        0|             24|              3|               3|           2|                1|              3|                  0|                2|                9|           0|           0|           0|           0|           0|       0|            3|       11|       1|
|5899|      1950|       PhD|      Together|  5648|      1|       1| 2014-03-13|     68|      28|        0|              6|              1|               1|          13|                1|              1|                  0|                0|               20|           1|           0|           0|           0|           0|       0|            3|       11|       0|
|1994|      1983|Graduation|       Married|  null|      1|       0| 2013-11-15|     11|       5|        5|              6|              0|               2|           1|                1|              1|                  0|                2|                7|           0|           0|           0|           0|           0|       0|            3|       11|       0|
| 387|      1976|     Basic|       Married|  7500|      0|       0| 2012-11-13|     59|       6|       16|             11|             11|               1|          16|                1|              2|                  0|                3|                8|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|2125|      1959|Graduation|      Divorced| 63033|      0|       0| 2013-11-15|     82|     194|       61|            480|            225|             112|          30|                1|              3|                  4|                8|                2|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|8180|      1952|    Master|      Divorced| 59354|      1|       1| 2013-11-15|     53|     233|        2|             53|              3|               5|          14|                3|              6|                  1|                5|                6|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|2569|      1987|Graduation|       Married| 17323|      0|       0| 2012-10-10|     38|       3|       14|             17|              6|               1|           5|                1|              1|                  0|                3|                8|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|2114|      1946|       PhD|        Single| 82800|      0|       0| 2012-11-24|     23|    1006|       22|            115|             59|              68|          45|                1|              7|                  6|               12|                3|           0|           0|           1|           1|           0|       0|            3|       11|       1|
|9736|      1980|Graduation|       Married| 41850|      1|       1| 2012-12-24|     51|      53|        5|             19|              2|              13|           4|                3|              3|                  0|                3|                8|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|4939|      1946|Graduation|      Together| 37760|      0|       0| 2012-08-31|     20|      84|        5|             38|            150|              12|          28|                2|              4|                  1|                6|                7|           0|           0|           0|           0|           0|       0|            3|       11|       0|
|6565|      1949|    Master|       Married| 76995|      0|       1| 2013-03-28|     91|    1012|       80|            498|              0|              16|         176|                2|             11|                  4|                9|                5|           0|           0|           0|           1|           0|       0|            3|       11|       0|
|2278|      1985|  2n Cycle|        Single| 33812|      1|       0| 2012-11-03|     86|       4|       17|             19|             30|              24|          39|                2|              2|                  1|                3|                6|           0|           0|           0|           0|           0|       0|            3|       11|       0|
+----+----------+----------+--------------+------+-------+--------+-----------+-------+--------+---------+---------------+---------------+----------------+------------+-----------------+---------------+-------------------+-----------------+-----------------+------------+------------+------------+------------+------------+--------+-------------+---------+--------+
only showing top 20 rows

#### Drop columns that we don't need it

In [6]:
df = df["id","year_birth","education","marital_status","income","dt_customer"]
df.show()

+----+----------+----------+--------------+------+-----------+
|  id|year_birth| education|marital_status|income|dt_customer|
+----+----------+----------+--------------+------+-----------+
|5524|      1957|Graduation|        Single| 58138| 2012-09-04|
|2174|      1954|Graduation|        Single| 46344| 2014-03-08|
|4141|      1965|Graduation|      Together| 71613| 2013-08-21|
|6182|      1984|Graduation|      Together| 26646| 2014-02-10|
|5324|      1981|       PhD|       Married| 58293| 2014-01-19|
|7446|      1967|    Master|      Together| 62513| 2013-09-09|
| 965|      1971|Graduation|      Divorced| 55635| 2012-11-13|
|6177|      1985|       PhD|       Married| 33454| 2013-05-08|
|4855|      1974|       PhD|      Together| 30351| 2013-06-06|
|5899|      1950|       PhD|      Together|  5648| 2014-03-13|
|1994|      1983|Graduation|       Married|  null| 2013-11-15|
| 387|      1976|     Basic|       Married|  7500| 2012-11-13|
|2125|      1959|Graduation|      Divorced| 63033| 2013-11-15|
|8180|      1952|    Master|      Divorced| 59354| 2013-11-15|
|2569|      1987|Graduation|       Married| 17323| 2012-10-10|
|2114|      1946|       PhD|        Single| 82800| 2012-11-24|
|9736|      1980|Graduation|       Married| 41850| 2012-12-24|
|4939|      1946|Graduation|      Together| 37760| 2012-08-31|
|6565|      1949|    Master|       Married| 76995| 2013-03-28|
|2278|      1985|  2n Cycle|        Single| 33812| 2012-11-03|
+----+----------+----------+--------------+------+-----------+
only showing top 20 rows

#### Check NaN values for each column

In [9]:
from pyspark.sql.functions import *

df.select([count(when(col(c).isNull(),c)).alias(c) for c in df.columns]).show()

+---+----------+---------+--------------+------+-----------+
| id|year_birth|education|marital_status|income|dt_customer|
+---+----------+---------+--------------+------+-----------+
|  0|         0|        0|             0|    24|          0|
+---+----------+---------+--------------+------+-----------+

#### There are 24 NaN values in "income" column. Let's fill NaN values with mean.

In [11]:
# Calculate the mean value of the column
mean_value = df.select(mean(col('income'))).collect()[0][0]

# Fill missing values with the mean value
df = df.fillna(mean_value, subset=['income'])

# Check
df.select([count(when(col(c).isNull(),c)).alias(c) for c in df.columns]).show()

+---+----------+---------+--------------+------+-----------+
| id|year_birth|education|marital_status|income|dt_customer|
+---+----------+---------+--------------+------+-----------+
|  0|         0|        0|             0|     0|          0|
+---+----------+---------+--------------+------+-----------+

#### Write the data to our S3 Bucket named "transformed_data" as csv.

In [18]:
df.write \
    .format("csv") \
    .mode("append") \
    .option("header", "true") \
    .save("s3://etl-project-for-medium/etl-project-for-medium-database/transformed_data/")

#### Write the data to our S3 Bucket named "transformed_data" as json.

In [19]:
df.write \
    .format("json") \
    .mode("append") \
    .save("s3://etl-project-for-medium/etl-project-for-medium-database/transformed_data/")